AcRxMemberQueryContext.subNewMemberIterator(AcArray&lt;AcRxClass!System.Runtime.CompilerServices.IsConst**,AcArrayMemCopyReallocator&lt;AcRxClass!System.Runtime.CompilerServices.IsConst**&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
The derived class must override this method and return the members
appropriate to the context.
facets:
Input reference to an AcArray object, to receive the facets.
Returns:
Returns pointer to AcRxMemberIterator if there are members; otherwise, returns NULL.

AcRxMemberQueryContext.Dispose
Destructor

AcRxMemberQueryContext.#ctor
Constructor

AcRxMemberQueryContext.newMemberIterator(AcArray&lt;AcRxClass!System.Runtime.CompilerServices.IsConst**,AcArrayMemCopyReallocator&lt;AcRxClass!System.Runtime.CompilerServices.IsConst**&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This method is called by AcRxMemberQueryEngine::newMemberIterator to
get the members relevant to the context.
facets:
Input set of classes for which to get the members.
Returns:
Returns the pointer to AcRxMemberIterator if there are members, otherwise it returns NULL.

AcRxMemberQueryContext
This class provides other contextual data about the query to influence
the set of members. The derived classes can implement their own context
and return the members relevant to the context.